{ pkgs, ... }: {
    home.packages = with pkgs; [
        fish
        starship
    ];

    programs.fish = {
        enable = true;
        interactiveShellInit = ''
            starship init fish | source
        '';
        functions = {
            fish_greeting = ''
                echo -e (set_color white)"
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡄⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣼⣉⣛⣶⡶⠛⠉⠳⣶⡄
⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⠴⠖⠂⠀⠀⠀⠀⠒⠚⠉⢹⠉⡏⠁⠀⠀⠀⣰⣿⠟
⠀⠀⠀⠀⣀⣤⡶⠿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⠿⠋⠀⠀⠀⠀⠀☾⊹₊ ⋆ \e[3mwhen my body returns to stardust\e[0m,
⠀⢀⣴⣿⠟⠉⠀⢠⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⣀⣤⠶⠞⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\e[3mwill you remember me?\e[0m  ₊˚⊹ ♡
⢰⣿⡟⠁⠀⠀⢀⣿⡄⠀⠀⠀⠀⠀⣘⣇⠀⠀⢀⠖⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀
⠘⠿⣧⣀⣠⣤⣹⣿⣿⡶⠆⠶⠶⢾⣿⡿⡇⠿⠟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠙⣿⠁⠀⠀⠀⠀⠀⢩⡍⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠋⠀⠀⠀⠀⠀⠀⠸⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                " (set_color white)
            '';
            clr = "clear && fish_greeting";
            rustlings = "~/.cargo/bin/rustlings";
        };
    };

    programs.starship = {
        enable = true;
        enableFishIntegration = true;
        settings = pkgs.lib.importTOML ./starship.toml;
    };
}
